{
  "-MSbz99qxklK-5rZWGmt":{
  "title": "Logo design process & logo ideas",
  "text": "Logos are viewed as the most memorable part of a company and as such designing one is quite tricky.",
  "description": "A logo is a visual representation of your brand, so why tell people what you do if you could just show them? Use simple icons to communicate who you are.Remember the brand vibe we talked about earlier? The use of the plane and the sun here makes me feel excited and reminds me of warm sunny holidays.Visual puns are a designer’s best friend too – here Frost Bites have created a quirky ‘bite’ to show that they are a food company. This is really easily achieved by overlapping two circles that are the same color as the background.",
  "mainImg": "https://helpx.adobe.com/content/dam/help/en/illustrator/how-to/start-logo-design/jcr_content/main-pars/image/start-logo-design-intro_900x506.jpg",
  "art1Title": "The main overview of the logo design process",
  "art1Text": "The logo design process can be hard to define outright: every graphic designer has their own approach to logo development. But one very important step is gathering inspiration from competition or other sources. Another important step is to choose the right type of logo, from monogram logos, logotypes, logo symbols, Abstract logo marks and others. Colors can have a ton of different meanings. The psychology behind color is complex, but to keep it short, colors have certain emotions and ideas attached to them. Of course you don’t need to stick with a monochrome logo using just one color, but you can combine several logos colors to tell a complete brand color story. You also want to pick a font that complements and completes your logo, from the smoother style of serif to the more bold style of sans serif, depending on what you want the audience to perceive from the logo. Evaluating your logo options can be hard, so get some feedback from friends, potential customers and colleagues to help you make a decision.",
  "art1Img": "https://www.bluefountainmedia.com/sites/default/files/insights/The-Logo-Design-Process.jpg",
  "art2Title": "What to look for in a logo & good practices",
  "art2Text": "You want your logo to communicate your brand’s personality. Make a list of words that describe your brand and how you want it to be perceived. Brainstorming is about getting all ideas out, think like a person in your target demographic and always remember what would be important to them. When thinking about your logo, the first thing you want to do is pick the right design aesthetic for your brand. There is no one style that is right for everyone, only what’s best for your brand. Of course these styles aren’t mutually exclusive: Just mix and match them to suit your brand. For instance your brand can be both handmade and fun at the same time, just take a look at how the quirky, illustrated logo for The Crafting Cactus pulls it off. Now that you have considered all of the necessary style points, you’re ready to start designing! A good logo is immediately recognizable, reflects your brand’s message and makes you stand out. An effective logo looks professional and seamlessly fits in with a brand’s identity. A great logo also needs to work at any size and anywhere you want to use your logo.",
  "art2Img": "https://i.pinimg.com/originals/e4/1c/82/e41c82de8e205d87c9ff21fc0065ddf8.jpg",
  "likes": [],
  "_id": "-MSbz99qxklK-5rZWGmt"
}, 
"-MSc-8DwUmBi8NG52eOH":{
  "title": "The power of white spaces in design",
  "text": "Use of white spaces can be often scary, but it does not have to be with the correct amount of it.",
  "description": "Using white space evenly makes the content in design easily scannable and significantly improves legibility. A study conducted indicates that proper use of white space between lines of paragraphs and its left and right margins can increase comprehension up to 20%.",
  "mainImg": "https://cdn.iconscout.com/wordpress/2021/06/Macro-and-micro-white-spaces.png?w=1440&h=0",
  "art1Title": "Why do designers use white spaces?",
  "art1Text": "Designers use white space as an integral part of their design for good reasons. When used well it can transform not only the design but also the business for which the design is made. While aesthetics is one of the benefits, others revolve around tangible impacts on the effectiveness of the page. In other words, white space significantly boosts not only UI(User Interface) but also UX(User Experience) of the page.",
  "art1Img": "https://miro.medium.com/max/3080/1*sAn5fVYWiVe-m6lflHqmCA.jpeg",
  "art2Title": "Branding, local grouping & the visual aspect",
  "art2Text": "In this world of visual chaos, one of the aspect our mind uses to organise visual information is the Law of Proximity, established by Gestalt psychologists. Use of micro and macro white spaces in different proportions help in defining the character of web page. News websites are good examples of websites which use micro white spaces more than macro white spaces. Heavy use of macro white spaces brings in a sense of sophistication and luxury to the web pages. Do not agree? Have a look at websites of Apple or Microsoft. If asked to keep marketing websites aside, have a look at Google’s Mail, Drive or Docs. Content driven website like Medium itself displays beautiful use of white spaces.",
  "art2Img": "https://miro.medium.com/max/1400/0*yJ6UCbVLoTOIbpDN.png",
  "likes": ["DMo4588516izQZ78HZ"],
  "_id": "-MSc-8DwUmBi8NG52eOH"
},
"-MSgyY8fK5DetuiWvbbX":{
  "title": "Styling your site for 2022",
  "text": "Every year brings forth some new and reoccurring good practices. With 2022 comes a new wave of ideas and popular designs for sites.",
  "description": "Sometimes the most effective site is the least complex one. One-page sites work best when their subject matter is narrower, like a portfolio or the presentation of a single idea. These sites evoke the feeling of holding a flyer or reading a poster. All the information you need to review is in one place without the distraction of navigation or searching multiple pages. It lets its subject be the focus of attention. This makes it more likely that a casual viewer will read the entire resume since everything they need is right up front.",
  "mainImg": "https://mbcreative.ca/blog/wp-content/uploads/2020/03/image_processing20200217-904-j9hrxy.png",
  "art1Title": "The benefits of app-like experiences",
  "art1Text": "Jeremy Beyt, co-founder of ThreeSixtyEight, strongly believes these sorts of smaller, experience-focused sites are the future of web design. He explains: “A front-end-driven web experience that’s really overblown from a design standpoint is a whole new way of using the web that hasn’t existed before; it's an app-like experience. That, to me, is the opportunity right now.” The world has gotten used to apps, where interaction, animation, and dynamic experiences are the norm. The logical next step is bringing that energy to websites and creating more unique experiences there.",
  "art1Img": "https://www.mobindustry.net/wp-content/uploads/darkmode.jpg",
  "art2Title": "Making a page more welcoming",
  "art2Text": "The web can be a detached place where you often have no connection to where the site you’re browsing is coming from. Adding a note like “made with love in ...” or featuring an image of your favorite nearby spot prompts visitors to picture where you are and creates a small real-world connection for them. If we have been traveling less, at least we can remember we are making connections all over the world online.  ‍Grace Potter uses this beautiful ocean image as her landing page, even though it isn’t directly related to her work. With this photograph, she grounds her website in her New Zealand roots, bringing the visitor into her world.",
  "art2Img": "https://assets-global.website-files.com/6009ec8cda7f305645c9d91b/616df0b586905129af1f27d2_grace%20potter%20website.jpg",
  "likes": [],
  "_id": "-MSgyY8fK5DetuiWvbbX"
},
"-MSgyo88wO16izQZCVjh": {
  "title": "Tips for making a re-brand design for a company",
  "text": "Re-branding is one very important part of changing the way a company functions and is seen and as such the design is of utmost importance.",
  "description": "As much as effective branding design is an art, it’s also a clearly defined science. In fact, it’s a topic that has been thoroughly studied by countless researchers over the past several decades. After all, when done right, branding design can have a dramatic impact on the way customers view a brand, whether or not they trust said brand, and in turn, its long-term growth and success.",
  "mainImg": "https://assets.turbologo.com/blog/en/2020/07/19084412/logo-rebr-958x575.png",
  "art1Title": "Main goals to checkout",
  "art1Text": "A very important part is to do your research on the company and the direction it is going in. Next, build a Brand That Works in Multiple Mediums, that can be used universally in more than one situation. Make sure to speak to your ideal buyer. Establish standalone icons and typography to further help the look that you are going for and work to make a unique style, that is both memorable and very represents the company is a positive light.",
  "art1Img": "https://www.designmantic.com/blog/wp-content/uploads/2019/01/Rebrands-of2018.png",
  "art2Title": "Checking the competition & staying true to the brand",
  "art2Text": "For both branding and rebranding, it pays to look at what your competition is doing and adapt your strategy accordingly. It’s not enough to create the perfect strategy for your audience, you also have to factor in what your competitors are doing and how to one-up them. By now you understand what needs to change, what your target customers want and what your rivals are up to. With that, you can start to build your new brand personality—but not without a plan. Feel free to return to the earlier checklist to make sure you got everything. Remember you don’t need to change everything, just what’s necessary. Once you have what you need and everyone’s agreed to it, you’re ready to introduce your rebrand to the public.",
  "art2Img": "https://99designs-blog.imgix.net/blog/wp-content/uploads/2021/10/microsoft-logo.jpg?auto=format&q=60&fit=max&w=930",
  "likes": ["SLoho8iwj16kzQZCVjh", "PTo4588wO16izQZCVjh"],
  "_id": "-MSgyo88wO16izQZCVjh"
},
"-MSgho8iwj16kzQZCVjh": {
  "title": "Choosing the right font for your next project",
  "text": "Fonts often prove difficult to choose because of their sheer numbers, but they can be viewed on a much simpler level.",
  "description": "Typography helps create harmony and consistency in a design. In brand identity design, it's important to create visual consistency across all platforms. In website design, this looks like using consistent heading and body fonts throughout the site.A good typeface can increase the reading pleasure of the viewer. It is important to choose the right typeface that is suited to the particular situation and even the best typefaces cannot be used effectively in every situation.",
  "mainImg": "https://i.fbcd.co/products/resized/resized-750-500/d176f604f496c3d58115d4c58f6fdb23a39ce9373a90b57163b349d795563afb.jpg",
  "art1Title": "What to lookout for in fonts",
  "art1Text": "It is important for a font to be legible in order for the reader to be able to distinguish one letter from another. There are many factors that need to be taken into account when considering the legibility of the text. These factors include character shapes, size of counters, character width, weight, ascender and descender length and stroke contrast. Most people agree that a simple Arial Black or Verdana as a font for headings will give your proposal a clean and professional look. Avoid “loud” fonts such as Goudy Stout.",
  "art1Img": "https://d3ui957tjb5bqd.cloudfront.net/uploads/2013/10/Screen-Shot-2013-10-29-at-9.15.47-AM-560x522.png",
  "art2Title": "Good practices in picking fonts",
  "art2Text": "Generally, serif typefaces are easier to read for lengthy copy than sans. Serif fonts help the eye travel across a line, especially if lines are long. But it's also important to consider your target audience. Sans is preferable for young children, or anyone just learning to read. If you're working on a portfolio project then try using Proxima Nova or Montserrat for its detailed and nice look.",
  "art2Img": "https://www.designhill.com/design-blog/wp-content/uploads/2014/10/logo-design-fonts.jpg",
  "likes": ["ZSgyh8iwj16kzQZ4Vjh"],
  "_id": "-MSgho8iwj16kzQZCVjh"
},
"-MSgyo884O163zQZCVj9": {
  "title": "Re-igniting your creativity and how to do it",
  "text": "Creative block comes every so often in every designers life. The art of learning to deal with creative blocks is one of the most important skills that designers need to have.",
  "description": "Everyone has those moments when you can't simply think of anything creative. One of the greatest lessons I learned from four years of Art school is that design (and really anything creative) is a process. When you feel blocked creatively, the best thing you can do is work through it.",
  "mainImg": "https://www.creativeline.co.in/images/shutterstock_600742874.jpg",
  "art1Title": "Staying in motion",
  "art1Text": "Even if the work you are doing is terrible, silly, or unsuccessful, you must continue to work. One of my favorite exercises is to try to design the worst possible solution to the problem before me. Inevitably this helps get me on the right track. It seems like you're at a point where your taste has evolved beyond your skill. Design is the process of FINDING the right answer, not inventing it. All of the fundamental components of design (colors and typefaces and shapes and compositions and layouts) already exist, and the design process is about finding the best combination of these elements for your specific problem. Too many novice designers try to do this in their heads, thinking up a solution, then writing it off as bad or silly before creating it.",
  "art1Img": "https://freight.cargo.site/t/original/i/c1419da2baa4eb114ea3bfea626416a376b5492517211bed0b3f9558e32948d7/Writer-s-Block---kleur.jpg",
  "art2Title": "Keeping an open mind & going forward",
  "art2Text": "Remove the filter. Make the first thing that pops into your head. Continue this process until you have a sea of solutions in front of you and then figure out which of them are working and in what ways. The second part is the truly hard part, and why many of the most influential, talented, and proven designers end up in the role of Art Director. Visually making things is easy once you've gotten the hang of it, figuring out which of those thing is working is really what design is.",
  "art2Img": "https://payload.cargocollective.com/1/21/692429/14243836/New_CreativeBlockFigure_Small2_2500_c.jpg",
  "likes": [],
  "_id": "-MSgyo884O163zQZCVj9"
},
"-MSgPo88LO16TzQ7CVj4": {
  "title": "The importance of illustrations",
  "text": "Illustrations are important if you want to express a message. Especially an idea that is hard to describe in words and verbally.",
  "description": "An illustration is a decoration, interpretation or visual explanation of a text, concept or process, designed for integration in print and digital published media, such as posters, flyers, magazines, books, teaching materials, animations, video games and films. Illustrations provide young readers with an immediate vision of the characters, setting, and mood of the story. Children instantly respond to characters from their visual appeal. We all know and love many picture book characters from their image alone. ",
  "mainImg": "http://unblast.com/wp-content/uploads/2020/05/Graphic-Design-Vector-Illustration.jpg",
  "art1Title": "The fundamentals of illustration",
  "art1Text": "The main goal of a work of art is aesthetics. The distinction lies in the fact that Art is the idea (brought to life) while an illustration is only a depiction (or explanation) of an idea. The main purpose of an illustration is to explain. An illustration is created for the needs of a specific customer with specific goals, and a work of art can be made without it.",
  "art1Img": "https://bueskenart.com/wp-content/uploads/2020/04/what-makes-a-drawing-good-2.jpg",
  "art2Title": "Clarity and simplicity",
  "art2Text": "Illustrations should faithfully depict and explain what is described in the written text. They should be clear and accurate and not give rise to ambiguities. From this standpoint, drawings are often more effective than photos. A good illustration is still illumination, not decoration. It should be an aid to composition, emphasis and understanding. It should be both intellectual and emotional. If possible, the message should be sincere, genuine, and original.",
  "art2Img": "https://i.pinimg.com/originals/21/b0/bd/21b0bd4f26e5fd846852987b05be64f8.jpg",
  "likes": [],
  "_id": "-MSgPo88LO16TzQ7CVj4"
},
"-MSzLo80LO15TzO7CVj4": {
  "title": "Trending color pallets for web and material design",
  "text": "The latest web design trends have brought to light the fierce rivalry between Color and Typography to dominate the visual experience.",
  "description": "Joining a palette of earthy, grounding hues, we’re going to see fresh new takes on primary colors like green, blue and orange. From cerulean blue and ash green to burnt coral, it’s all about embracing the unexpected. Here are the biggest color trends and top color combinations for 2022, as predicted by leading color experts and paint companies. Colors are incredibly compelling. They significantly impact our emotions and how we behave. In certain contexts, their effect is universal, but our perception of color is largely subjective. How we respond to certain hues is dependent on a number of factors, including gender, age and culture. Colors inform how the viewer should start to feel. So from a branding perspective, they should represent the purpose and personality of a product or brand. For example, the color blue is perceived as reliable and trustworthy, making it a popular choice for corporate businesses.",
  "mainImg": "https://www.techvantage.org/wp-content/uploads/2021/05/color-palette-cover-3-1015x698.jpg",
  "art1Title": "Pastel designs on the rising",
  "art1Text": "Pastels are pretty. They’re soft, they’re sweet, they’re the perfect palette for springtime. But you might not call pastels adventurous…until now. In 2022, expect to see more designs that give pastels a twist. That twist could be pairing them with geometric shapes, line illustrations, or displaying them in full-on, funky patterns that are going for a maximalism design style by filling space with objects, colors and patterns that mirror the whim of the artists. By using pastels in unconventional and creative ways, designers are twisting expectations to create disharmony or edgy-ness. They’re playing with saturation to create bolder pastels, or pairing them with neons or intricate patterns.",
  "art1Img": "https://previews.123rf.com/images/ivaleksa/ivaleksa1610/ivaleksa161000020/66070697-a-set-of-six-abstract-geometric-designs-in-black-white-light-blue-and-pastel-pink-modern-and-origina.jpg",
  "art2Title": "The memorability of Memphis design",
  "art2Text": "Memphis design is one of the defining design styles from the 1980s. Its aesthetic is characterized by colorful, abstract, geometric shapes and squiggles. It rejected the high art and minimalism that dominated over the previous decades. And now, after years of polished, minimal color palettes, the abstract shapes and color combinations from Memphis design are reemerging to bring vibrant quirkiness back into the mainstream. What we get are colors combinations that are playful, fun and most importantly, don’t take themselves too seriously—which is exactly why it’s making a big comeback in 2022’s color trends.",
  "art2Img": "https://99designs-blog.imgix.net/blog/wp-content/uploads/2021/11/Screen-Shot-2021-11-21-at-12.33.28-PM.png?auto=format&q=60&fit=max&w=930",
  "likes": ["LL02L80LO15TzO7CVjl", "KDo84LO15TzO76Vj7", "OPgyh8iwj56kzQZ4Vhf"],
  "_id": "-MSzLo80LO15TzO7CVj4"
},
"-MSz3687L815TzOlorj8": {
  "title": "Inspiring poster designs and the art of making them",
  "text": "The latest web design trends have brought to light the fierce rivalry between Color and Typography to dominate the visual experience.",
  "description": "The main function of a poster is to capture a moving audience with a message. When designing a poster, plan its design carefully. You will have a short amount of time to attract and hold your readers attention. If it’s going on a wall with a bunch of other posters, print your poster in a larger size so it will stand out, But if it’s going on a relatively bare wall, print it in a smaller size and pin up a bunch of them to create a larger footprint like the minimalist poster design.  There are fewer restraints when designing a poster for web than for print. This is a great opportunity to do something really fun with your design. Still, there are some guidelines you should follow.",
  "mainImg": "https://miro.medium.com/max/3200/1*y69M_qLtiKuMRtzxf-gBIA.png",
  "art1Title": "Identify the goal of your poster & consider your target audience",
  "art1Text": "Think about the one aspect of the information that must convey the message and plan your design around that. At its core, a poster is made up of four key features: a title, graphic(s), text, and white space. Layout, flow, and color affect the order and style of these four key features. Effective posters have three traits: The information is written clearly and concisely. The information is presented in a way that places the meaning of the text ahead of the style that it is presented in. The poster is displayed in areas that are highly visible. Headings, columns, and graphics should be aligned whenever appropriate. For example, a poster is typically broken into columns.",
  "art1Img": "https://images.appypie.com/wp-content/uploads/2020/07/15193554/Appy-Pie-How-to-design-eye-catching-posters.png",
  "art2Title": "Consider the identity, hierarchy and the use of elements",
  "art2Text": "If you think about your main goals from the beginning, you can use that goal to guide your design choices. The poster design emphasizes the key information attendees will need to know, with a sleek, professional finish. Next, you should consider who you are trying to reach with your poster. Answering this question will probably inform a lot of your design choices. The final thing you should do before designing your poster is to think about where it will be shared. It’s important to decide where you want your poster to be seen before you start the design process. This is because, as you will see below, optimizing a poster properly for print is a bit different than for Twitter or Facebook. ",
  "art2Img": "https://i.pinimg.com/originals/e2/1c/7f/e21c7f32c0e41d73c50ad4cef552a6ed.jpg",
  "likes": ["JDzLoSDLOMDTzOLDVj9"],
  "_id": "-MSz3687L815TzOlorj8"
}
}